[{"title":"天子文言（THINCI W&NJEN）：一种基于商代字形和白沙拟音分别业余推演结合的类中古汉语架空语言","date":"2023-12-25T04:32:25.207Z","path":"2023/12/25/天子文言（THINCI-W-NJEN）：一种基于商代字形和白沙拟音分别业余推演结合的类中古汉语架空语言/","text":"背景天子文言，简称“文言(GrapHras)”，是中土帝国的官方语言、冷教和济世世界的通用语言。 中土帝国是主星（Cyysing，Theem&#x2F;Theen，地球）的政教合一国家，领土范围包括中土大陆（类澳大利亚大陆）和周边岛屿（包括部分马来西亚列岛）。 冷教，全称“冷教宗(Theover&#x2F;Theetym&#x2F;Theetumos)”，主导影响范围被称作“济世世界(Salvadam)”，官方语言是公文（Kosmeskos&#x2F;Kosmez，天子文言）和七文（拉丁语）。 详细介绍 文字字形中文原称“卜文”，占卜用的字形，较原手写体较为简化和硬朗，后逐渐向方正发展，常用于正文。 对应汉字篆-隶-楷演变。 大文原称“书文”，原手写用的标准字形，在卜文发展后逐渐式微，字形往复古方向发展，常作为标题大字形。 对应金文。 小文卜文&#x2F;中文的进一步简化字形，仅保留特征部件，适合较小字形和速记。 对应俗体、简体字。 拟构发音传统表示类切韵系统传统字母拉丁字母表示拉丁字母表示法也称作“七文中音”（商代文字“七”是十字形，“七文”直译为“十字教官方所用文字”），所用二十七个字母（“&amp;”被扶正为大写，小写为左下角相连的加号“+”,没有此符号可以使用阿拉伯数字“4”，也可以用国际音标半闭后不圆唇元音符号&#x2F;ɤ&#x2F;代替）。 在规范表示中，遵循全大写和一字一音原则，不连写。若连写，在可能引起混淆的情况下，声调表示法推荐采用双写方案。 例1： 中土帝国 TRYNG THUU TEKS KW&amp;K Tryngthuu Tekskw4k 例2： 中华人民共和国 TRYNG XWA NIN MIN GYNGS XOJ KW&amp;K Tryngxwa Ninmin Gyngsxojkwɤk 声母因为是由白沙拟音直接推演而得，所以在设置上参考了古代三十六声母（实际有四十二个）。 拉丁方案参考古韵罗马字（“polyhedron的中古漢語拼音”）。 全清 次清 全浊 次浊 全清 全浊 重唇音 帮&lt;p&gt; 滂&lt;ph&gt; 並&lt;b&gt; 明&lt;m&gt; 轻唇音 非&lt;f&gt; 敷&lt;fh&gt; 奉&lt;v&gt; 微&lt;w&gt; 舌头音 端&lt;t&gt; 透&lt;th&gt; 定&lt;d&gt; 泥&lt;n&gt; 舌上音 知&lt;tr&gt; 彻&lt;thr&gt; 澄&lt;dr&gt; 娘&lt;nr&gt; 半舌音 来&lt;l&gt; 齿头音 精&lt;c&gt; 清&lt;ch&gt; 从&lt;dz&gt; 心&lt;s&gt; 邪&lt;z&gt; 正齿音 庄&lt;cr&gt; 初&lt;chr&gt; 崇&lt;dzr&gt; 生&lt;sr&gt; 俟&lt;zr&gt; 章&lt;cj&gt; 昌&lt;chj&gt; 常&lt;dzj&gt; 书&lt;sj&gt; 船&lt;zj&gt; 半齿音 日&lt;nj&gt; 牙音 见&lt;k&gt; 溪&lt;kh&gt; 群&lt;g&gt; 疑&lt;ng&gt; 喉音 影&lt;q&gt; 以&lt;j&gt; 晓&lt;h&gt; 匣&lt;x&gt; 云&lt;y&gt; 韵母韵头 宽式音标 &#x2F;-i-&#x2F; &#x2F;-u-&#x2F; &#x2F;-y-&#x2F; 拉丁表示 -J&#x2F;j- -W&#x2F;w- -Y&#x2F;y- 对应拼音 -I&#x2F;i- -U&#x2F;u- -Ü&#x2F;ü- 韵头前卫影母q时，平声应发阴平声。 韵腹 宽式音标 &#x2F;a&#x2F; &#x2F;o&#x2F; &#x2F;e&#x2F; &#x2F;ɤ&#x2F; &#x2F;i&#x2F; &#x2F;u&#x2F; &#x2F;y&#x2F; 拉丁表示 Aa Oo Ee &amp;ɤ Ii Uu Yy 对应拼音 &#x3D; &#x3D; Êê Ee &#x3D; &#x3D; Üü 韵尾 宽式音标 &#x2F;-i&#x2F; &#x2F;-u&#x2F; &#x2F;-r&#x2F; &#x2F;-n&#x2F; &#x2F;-m&#x2F; &#x2F;-ŋ&#x2F; &#x2F;-p&#x2F; &#x2F;-t&#x2F; &#x2F;-k&#x2F; &#x2F;-uk&#x2F; 拉丁表示 -J&#x2F;j -W&#x2F;w -R&#x2F;r -N&#x2F;n -M&#x2F;m -NG&#x2F;ng -P&#x2F;p -T&#x2F;t -K&#x2F;k -WK&#x2F;wk 对应拼音 -I&#x2F;i -O&#x2F;o - &#x3D; - &#x3D; - - - - &#x2F;-i&#x2F;：在实际发音中，参考拼音-i韵尾。 &#x2F;-u&#x2F;：在实际发音中，参考拼音-o韵尾。 &#x2F;-r&#x2F;：在实际发音中，参考普通话儿化音。 &#x2F;-uk&#x2F;：在实际发音中，参考拼音-o韵尾并加入声-k。 声调 传统声调 平 上 去 入 宽式音标 - &#x2F;-ʔ&#x2F; &#x2F;-s&#x2F; &#x2F;-p&#x2F;&#x2F;-t&#x2F;&#x2F;-k&#x2F; 拉丁表示 - -Q&#x2F;q -S&#x2F;s -P&#x2F;p-T&#x2F;t-K&#x2F;k 对应拼音 ˉˊ ˇ ˋ - 平声：因为保留了浊音，所以这里不区分阴平和阳平（即普通话拼音第一、二声）。 上声：有两种表示方法。①将&#x2F;-ʔ&#x2F;转写为“Q&#x2F;q”，直接放在音节最后；②将韵腹双写（参考国语罗马字方案）。为美观考虑，这里推荐第二种。在实际发音中，参考普通话第三声。 去声：有两种表示方法。①将&#x2F;-s&#x2F;转写为“S&#x2F;s”，直接放在音节最后；②将声母首字母双写（参考日语罗马音促音）。为美观考虑，这里推荐第一种。在实际发音中，参考普通话第四声。 计划与进度发音推演表示文字字形词汇"},{"title":"一些个人翻译合集","date":"2023-12-08T13:42:40.269Z","path":"2023/12/08/一些个人翻译合集/","text":"原创设定中文名及其翻译注意：这部分翻译完全自设，存在大量架空单词，可能不符合对应语言语法规范，请谨慎观看。 table th:nth-of-type(1) { width: 25%; } table th:nth-of-type(2) { width: 5%; } table th:nth-of-type(3) { width: 25%; } table th:nth-of-type(4) { width: 25%; } table th:nth-of-type(5) { width: 20%; } 中文名 对应语言 对应翻译 其他语言翻译 备注 喵灵结社 英语 Mωlly Assn. [日] Myourei Kessha 东方魔法少女组织“茉莉会”的前身，标志是字符组成的猫头灵魂（M猫耳，ll双眼，ω猫嘴，y魂身）。 同尘合光 拉丁语 Similum Pulvis Cum Luceo, Pullux 设定背景并没有出具其他语言翻译的需要，此处拉丁语翻译只是比较通用的一种译转。 中土帝国 Tryng Thuu Teks Kwɤk 拉丁语 Divinum Kosmesarum &#x2F; Teksarum, Tex [希] Θειο της Κοσμες, Θεκς [英] Theodom of Kosmes [法] Theume de Kosmed [德] Gottreich Weltmitte [俄] Богство Мирсред 此“中文”非“汉语”，其“帝国”的意思是“上帝的国”。 联合国际 英语 United International, Unint, UNI [俄] Объединённых интернационал, Объинтерн, ООИ 国际左派政党组织，一般由中国牵头成立。 国际红军 英语 Workers’ and Peasants’ Red Army of Unint, WPRAU &#x2F; Intredarmy, Int Red Army, IRA [俄] Рабо́че-крестья́нская Кра́сная Армия Объинте́рна, РККАО &#x2F; Инкрасар, Интерн красная армия, ИКА 在联合国际设定里默认自带的武装力量。 外语名及其中译 外语名 原语言 中文翻译 其他语言翻译 备注 Barbed Rose 英语 荆棘玫瑰 西方魔法少女组织“蔷薇会”的前身，标识是红色的玫瑰花和铁丝网组成的花枝。 翻译关系不强的映射 中文名 映射语言 映射翻译 其他语言翻译 备注 离世庭院 英语 Paradiz [希] Παραδιζ [俄] Парадиз 同人翻译 外语名 原语言 常见翻译 个人翻译 备注 ブレシア帝国 日语 布雷西亚帝国 天权帝国 「ブレシア」个人罗马化为“Brescia”，根据Behind the Name的溯源路径（Brescia &gt; Brixia &gt; Brigantia &gt; Bridget），综合Behind the Name和Wikipedia，参考寓意“权力，力量，活力，美德(Bridget)”和“高(Brigantia)”，所做的意识流意译。 ビローシス連合国 日语 比洛西斯同盟国 鸣钟合盟 「ビローシス」个人罗马化为“Billosis”，根据Wiktionnaire溯源，综合假定为“biellu（钟，铃）的异格单数billui的第三人称单数所有格”，再参考其他小说势力“钟声文明”“周天合盟”优化所意译。 ミーネルヴァ皇立学園 日语 密涅瓦皇立学园 明博皇立学园 「ブレシア」个人罗马化为“Minerva”，是罗马神话里的女神，与希腊神话里的雅典娜对应。Wikipedia词条中词源为*meneswo’ (‘智能，理解’)，更早(PIE) *menos (‘思想’)，以及假设的过渡形式*menes-ueh₂ (‘有头脑，有智慧’)，对比几个意译方案后的选择。 アブレイム・ストーン 日语 亚伯拉罕之石 先知石 个人罗马化为“Abraham Stone”，“Abraham”即“亚伯拉罕”，这里取他的身份“先知”。"},{"title":"关于“离世庭院(Paradiz)”","date":"2023-12-07T15:57:36.837Z","path":"2023/12/07/关于“离世庭院-Paradiz-”/","text":"本站名字由来按照最原本的设定，“离世庭院(Paradiz)”是 由“联合国际”和“泛大西洋公约”共建、共治、共享的综合性网络平台。 出处是个人同人小说《浮名虚利》。 设定的参考 这个设定有过参考，或者说名字有一半的照搬。 中文部分可能有使徒早就反应过来了，这个设定的中文名字出处就是古早宅文《希灵帝国》。 具体设定忘得差不多了，但这个名字我一直印象深刻，刚好我在做设定的时候，需要给一个“用于双方高层会面的第三方空间”命名，便第一时间想起了这个。 外语部分外语的思路其实很简单，当初想的就是“天堂”“伊甸园”“乌托邦”，但很明显，Heaven Eden Utopia这类实在烂大街，所以辗转翻出了目前这个不怎么常见的表述。毕竟在设定里，好歹也是商标的一部分。 虽然因为设定的原因，外文只给了英语——或者说拉丁字母——形式，但其实这个是古法语，寓意是“天国，乐土，理想之地”，其对应的英语应该是Paradise。 而根据设定，外文还有希腊字母和西里尔字母的转写形式，分别是Παραδιζ 和Парадиз，但基本没有出场机会，所以暂且按下不表。 标识部分 Paradiz 中文字形参考了胡晓波真帅体，西文字形参考了Josefin Sans。 实际上，最开始的字形是我自己琢磨的，考虑到预想中主页的极简风格，顺手拿了“庭”字做可行性设计： 看起来还可以。 然后用来测试的西文是“d”，效果与上面的成品图大差不离。 接着就是用自己造出来的字形去找有没有类似的字体，不过除了西文找到了理想参照外，中文在经历了各种手段搜寻后，最后圈定的真帅体看起来还是不理想，所以最后还是得靠自己造。 字形设计的时候从简，所以参考了草书字形，有些不好做出来的结构（我个人崇尚确定可重复的形状）就按自己的理解进行简化，成品如下： 中文相连，最后与西文交并，便是最后的标识成品。 本来理想是作为网页抬头存在，但Hexo的主题好像都不支持，所以暂时退了一步，当作头像使用。 选择这个名字的原因因为做过很多设定，所以每次选名字的时候都会选择困难。 其实最开始的时候并没有考虑用“离世庭院”：这个名字太大了，一个由两大跨国政治集团共同建立的互联设施，甚至在双方脑子都快打出来的时候都没关停断网的含金量，用在一个小博客上实在折寿。 但翻了一圈，好像也没别的能选，而这个起码看起来好歹符合主题：一个独立于主流之外的小世界。于是我仗着拿笔的特权，给她加了个设定： 本作为双方高层虚拟会晤场所，以此背书，经过不断发展，逐渐成为国际最大的综合网络平台。 说人话就是，把一个VRChat的小房间，变成一个垄断级别的多媒体社交平台。 看起来很离谱，实际上也不现实，但起码我有个理由用这个名字了：这么大一个平台，公益性挂靠一个个人主页很合理吧？——实在不行我就把“公益性”写进设定的公约里去，反正两家智库都不缺这点算力。 网站的定位正如Hexo的本职，这个网站就是一个简单的个人主页，可能偶尔发几篇文章，记录一下思路，以及一些过不了主流平台自审的东西，不过现在还在研究怎么装修主页，未来可能会买一个域名，不过以后再说吧。 最后，感谢SaltA大佬领我入门，虽然最后我翻的教程已经不是她给我的那篇了，但依然感激不尽m(_ _)m。"},{"title":"Hello World","date":"2023-12-04T15:21:26.525Z","path":"2023/12/04/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment"}]